app/Models/GestionEstudiantesAutos.php

    public function NroAlerta()
    {

            $builder = $this->db->table('alerta_conductor');

            return $builder->where('estado', 1)->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "alerta_conductor"
WHERE "estado" = 1