app/Models/GestionModeloDatosGeoModel.php

SELECT "e"."imagenestudiante", "e"."nombre", "e"."apellido", "e"."curso", ST_X(h.ubicacion) AS longitud, ST_Y(h.ubicacion) AS latitud, "h"."tipo", "h"."descripcion", "h"."avenida", "h"."puerta"
FROM "estudiantes" "e"
JOIN "hogar_estudiante" "h" ON "e"."id" = "h"."estudiante_id"
WHERE "e"."estado" = 1
---
    public function UbicacionHogarEstudiante()
    {
        $query = $this->db->table('estudiantes e')
        ->select('e.imagenestudiante, e.nombre,e.apellido,e.curso, ST_X(h.ubicacion) AS longitud,
        ST_Y(h.ubicacion) AS latitud ,h.tipo,h.descripcion,h.avenida,h.puerta')
        ->join('hogar_estudiante h', 'e.id = h.estudiante_id')
        ->where('e.estado', 1)
        ->get();