app/Models/GestionDatosGraficasModel.php

SELECT COUNT(*) AS "numrows"
FROM "estudiantes"
WHERE "estado" = 1
SELECT COUNT(*) AS "numrows"
FROM "padre"
WHERE "estado" = 1
SELECT COUNT(*) AS "numrows"
FROM "conductor"
WHERE "estado" = 1
SELECT COUNT(*) AS "numrows"
FROM "administrador"
WHERE "estado" = 1
---
    public function numeroUsuarios()
{
    $builder = $this->db->table('estudiantes');
    $builder->where('estado', 1);
    $estudiantes = $builder->countAllResults();



    $builder = $this->db->table('padre');
    $builder->where('estado', 1);

    $padre = $builder->countAllResults();

    $builder = $this->db->table('conductor');
    $builder->where('estado', 1);

    $conductor = $builder->countAllResults();

    $builder = $this->db->table('administrador');
    $builder->where('estado', 1);

    $administrador = $builder->countAllResults();

SELECT COUNT(*) AS "numrows"
FROM "dispositivo_gps"
WHERE "estado" = 1
SELECT COUNT(*) AS "numrows"
FROM "dispositivo_rfid"
WHERE "estado" = 1
SELECT COUNT(*) AS "numrows"
FROM "automovil"
WHERE "estado" = 1
---
public function numeroUsuariosDispositivo()
{
    $builder = $this->db->table('dispositivo_gps');
    $builder->where('estado', 1);
    $dispositivos_gps = $builder->countAllResults();

    $builder = $this->db->table('dispositivo_rfid');
    $builder->where('estado', 1);
    $dispositivos_rfid = $builder->countAllResults();

    $builder = $this->db->table('automovil');
    $builder->where('estado', 1);
    $automovil = $builder->countAllResults();